package lesson_2.part_2;

public class task_6 {
    /*
    Напишите программу вывода всех четных чисел от 2 до 100
Включительно
     */
    public static void main(String[] args) {
        for (int i = 1; i != 51; i++) System.out.print((2 * i) + " ");
    }
}

